require './brewfiles/m1_utils.rb'

brew "zsh-completion"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "rsync"
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "nkf"
brew "jq"
brew "pigz"

brew "awscli"
#brew "azure-cli"
cask "google-cloud-sdk"

brew "mysql"
brew "postgresql@16"
